"""
===============***===============
Auther : Lee
Date   : 2022-11-02 - 13:36
File   : python_basic10.py
===============***===============
"""
"""
本章讲解：列表

列表的定义：【】
列表的作用：可以储存任意类型的一组数据，比如我们的双色球
列表也属于序列之一，列表是可变类型
"""

# 1.列表的声明
red_balls = []  # 定义了一个空列表
print(type(red_balls), red_balls)  # <class 'list'> []
red_balls = [1, 2, 3, 4, 5, 6]  # 存放了一组数字
print(red_balls)  # [1, 2, 3, 4, 5, 6]

# 2.为列表添加单个元素：append()
red_balls.append(7)  # 追加在列表的末尾
print(red_balls)  # [1, 2, 3, 4, 5, 6, 7]
red_balls.append([1, 2, 3])  # 这里也是【1，2，3】被视为一个元素
print(red_balls)  # [1, 2, 3, 4, 5, 6, 7, [1, 2, 3]]
# 添加多个元素：extend([列表])
student = []
student.extend(['小花', '小美', '小帅'])
print(student)  # ['小花', '小美', '小帅']

# 3.获取元素：列表和字符串一样有下标，我们可以根据下标访问元素
student = ["张飞", "关羽", "刘备", "曹操", "郭嘉", "荀或", "孙权", "周瑜", "陆逊"]
print(student[0])  # 张飞
print(student[-1])  # 陆逊
# 切片和字符串一样；包前不包后
print(student[:3])  # ['张飞', '关羽', '刘备']
print(student[::-1])  # 反转
print(student[1::2])  # ['关羽', '曹操', '荀或', '周瑜']

# 4.修改元素，使用下标修改
student = ["张飞", "关羽", "刘备", "曹操", "郭嘉", "荀或", "孙权", "周瑜", "陆逊"]

student[3] = '曹孟德'  # 通过下标修改值
print(student)  # ['张飞', '关羽', '刘备', '曹孟德', '郭嘉', '荀或', '孙权', '周瑜', '陆逊']

# 5.删除元素
# 删除方式一，通过下标删除
student.pop(5)
print(student)  # ['张飞', '关羽', '刘备', '曹孟德', '郭嘉', '荀或', '孙权', '周瑜', '陆逊']
# student.pop(8) #下标越界异常
# 删除方式二，通过值删除，删除第一次出现的元素
student = ["张飞", "关羽", "刘备", "曹阿满", "郭嘉", "荀或", "孙权" "周瑜" "陆逊", "曹阿满"]
student.remove('曹阿满')
print(student)  # ['张飞', '关羽', '刘备', '曹孟德', '郭嘉', '孙权', '周瑜', '陆逊']

# 练习
# 1.声明一个空列表,并且往其中追加5个元素(包含'Xx'元素)
girls = []
girls.extend(['xx', '貂蝉', '西施', '王昭君', '杨玉环', '窦路遇'])
print(girls)  # ['xx'， '貂蝉'， '西施'， '王昭君， '杨玉环，'窦路遇]

# 2.修改'XX'元素为YY"元素
girls[0] = 'yy'
print(girls)  # ['yy', '貂蝉', '西施', '王昭君', '杨玉环', '窦路遇']

# 3.删除’YY‘元素
girls.remove('yy')
print(girls)  # ['貂蝉'， '西施'，'王昭君'，‘杨玉环，'窦路遇']

# 4.删除下标为2的元素.
girls.pop(2)
print(girls)  # ['貂蝉', '西施', '杨玉环', '窦路遇']

# 列表嵌套:一.个列表中可以再次存放一 个列表
list1 = ["小刘", '老刘', '小帅', '老徐plus', '小强', ['刘德华', '张学友', '黎明', '郭富城']]

print(list1[-1][-1][-1])  # 城

# 获取刘德华
print(list1[-1][0])  # 刘德华
# 修改郭富城为汪圣文
list1[-1][-1] = '汪圣文'
print(list1)  # ['小刘', '老刘', '小帅', '老徐plus', '小强', ['刘德华', '张学友', '黎明', '汪圣文']]

# 删除老徐plus
print(list1.index('老徐plus'))  # 3
list1.pop(list1.index('老徐plus'))
print(list1)  # ['小刘', '老刘', '小帅', '小强', ['刘德华', '张学友', '黎明', '汪圣文']]
# list1的0号位置插入老徐mini。  list.insert( 下标,值)   用inset
list1.insert(0, '老徐mini')
print(list1)  # ['老徐mini', '小刘', '老刘', '小帅', '小强', ['刘德华', '张学友', '黎明', '汪圣文']]

# 列表的反转和排序
red_balls = [10, 8, 100, 99, 54, 77, 84]
print(red_balls[::-1])  # [84, 77, 54, 99, 100, 8, 10]
red_balls.reverse()  # 反转
print(red_balls)  # [84, 77, 54, 99, 100, 8, 10]

# 排序
red_balls.sort()  # 排序，默认的是升序（从小到大）
print(red_balls)  # [8, 10, 54, 77, 84, 99, 100]
red_balls.reverse()  # 先升序排序在反转就是降序排序的列表
print(red_balls)  # [100, 99, 84, 77, 54, 10, 8]

red_balls = [10, 8, 100, 99, 54, 77, 84]
red_balls.sort(reverse=True)  # reverse默认值是False,也就是升序排序，改成True就是降序排序
print(red_balls)  # [100, 99, 84, 77, 54, 10, 8]
