"""
===============***===============
Auther : Lee
Date   : 2022-11-11 - 18:11
File   : func_value.py
===============***===============
"""
"""
函数传递值的方式:值传递、引用传递

值传递:传递的是变量的值而非变量本身,被传递的变量的值不会被改变

引用传递:传递的是变量本身,被传递的变量的值会被改变

可变类型使用的引用传递,不可变类型使用的是值传递
"""


def fun1(num):
    num += 1
    print(num)  # 11


a = 10
fun1(a)  # 11 值传递，传递的是变量的值，而非变量本身
print(a)  # 10


def fun2(list1):
    list1.append(1)
    print(list1)


list2 = [1, 2, 3, 4, 5]
fun2(list2)  # [1, 2, 3, 4, 5, 1]   引用传递，传递的是变量本身，变量的值会被改变
print(list2)  # [1, 2, 3, 4, 5, 1]
