"""
===============***===============
Auther : Lee
Date   : 2022-11-07 - 14:04
File   : python_basic24.py
===============***===============
"""
"""
面试问题
1什么是栈,什么堆
栈:用来保存变量名
堆:用来保存数据

2.id()用来查看物理地址

3.小整数池和大整数池的作用
整数池:(-5-256)

4.is 和 ==的区别
"""

# is 和==区别
# is 是身份运算符,判断对象的物理地址是否相同
# == 判断对象的值是否相等
a = 100
b = 100

print(id(a)), '----', id(b)
print(a is b)  # True
print(a is not b)  # False

# pycharm 大整数池
a = 257
b = 257
print(id(a), id(b))  # 2027723544016  ,2027723544016

a = -9999999999999
b = -9999999999999
print(id(a), id(b))  # 1360475575760 1360475575760
